# ProjectionLineColor Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
OverrideGraphicSettings..::..ProjectionLineColor Property
OverrideGraphicSettings Class See Also
---
Projection surface line color.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public Color ProjectionLineColor { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ProjectionLineColor As Color
	Get
```

Visual C++
---
```text
public:
property Color^ ProjectionLineColor {
	Color^ get ();
}
```

# See Also
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace